Progs/app/controllers/users_controller.rb

INSERT INTO "users" ("user_name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_name", "1"], ["password_digest", "$2a$10$2DNn4uoH9IiSyIA93uFdgOAfs/Sx9dP2DtA2njHCKd683QoAy5.Wq"], ["created_at", "2015-12-04 04:07:29.762251"], ["updated_at", "2015-12-04 04:07:29.762251"]]
---
  def create
    @user = User.new(user_params)
    if @user.save